In [1]:
import pandas as pd
import numpy as np

In [2]:
titanic = pd.read_csv(r"C:\Users\mayur\Downloads\13th - ML - Data preprocessing\13th - ML\5. Data preprocessing\Data.csv")
titanic.tail()

       State   Age   Salary Purchased
5     Mumbai  35.0  58000.0       Yes
6  Bangalore   NaN  52000.0        No
7     Mumbai  48.0  79000.0       Yes
8  Hyderabad  50.0  83000.0        No
9     Mumbai  37.0  67000.0       Yes

In [3]:
titanic.describe()

             Age        Salary
count   9.000000      9.000000
mean   38.777778  63777.777778
std     7.693793  12265.579662
min    27.000000  48000.000000
25%    35.000000  54000.000000
50%    38.000000  61000.000000
75%    44.000000  72000.000000
max    50.000000  83000.000000

In [5]:
#Name column can never decide survival of a person, hence we can safely delete it
titanic = titanic.drop(columns=["Name"], errors="ignore")

In [7]:
# Remove Ticket column safely
titanic.drop(columns=["Ticket"], inplace=True, errors="ignore")

# Check result
titanic.head()

       State   Age   Salary Purchased
0     Mumbai  44.0  72000.0        No
1  Bangalore  27.0  48000.0       Yes
2  Hyderabad  30.0  54000.0        No
3  Bangalore  38.0  61000.0        No
4  Hyderabad  40.0      NaN       Yes

In [9]:
# Remove Fare column safely
titanic.drop(columns=["Fare"], inplace=True, errors="ignore")

# Display first 5 rows
titanic.head()

       State   Age   Salary Purchased
0     Mumbai  44.0  72000.0        No
1  Bangalore  27.0  48000.0       Yes
2  Hyderabad  30.0  54000.0        No
3  Bangalore  38.0  61000.0        No
4  Hyderabad  40.0      NaN       Yes

In [10]:
# Remove Cabin column safely
titanic.drop(columns=["Cabin"], inplace=True, errors="ignore")

# Show first 5 rows
titanic.head()

       State   Age   Salary Purchased
0     Mumbai  44.0  72000.0        No
1  Bangalore  27.0  48000.0       Yes
2  Hyderabad  30.0  54000.0        No
3  Bangalore  38.0  61000.0        No
4  Hyderabad  40.0      NaN       Yes

In [15]:
def getNumber(str):
    if str=="male":
        return 1
    else:
        return 2
titanic["Gender"]=titanic["Sex"].apply(getNumber)
titanic.head()

KeyError: 'Sex'